"""
У Евлампии есть брошь с бриллиантами в виде дерева.
В каждом узле дерева есть какое-то количество бриллиантов.
Помогите выяснить, какое максимальное количество бриллиантов есть в одном узле.
В Трешландии может быть и отрицательное число драгоценных камней в украшении.

Формат ввода
На вход подается корень дерева.
Python:
class Node:
    def __init__(self, value, left=None, right=None):
        self.value = value
        self.right = right
        self.left = left
Ваша функция должна иметь сигнатуру solution(Node) -> int.

Формат вывода
Функция должна вернуть максимальное число бриллиантов в узле дерева.

Примечания
Решение нужно отправлять в виде файла с расширением соответствующем вашему языку программирования.
Нужно выбирать компилятор make.
"""

